Revit 2027 API
IFCExtrusionData.RemoveLoopAt Method
 Removes the loop at the specified index.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveLoopAt(
	int index
)
Public Sub RemoveLoopAt (
	index As Integer
)
public:
void RemoveLoopAt(
	int index
)
member RemoveLoopAt :
        index : int -> unit
Parameters
index Int32
 The zero-based index of the loop to remove.
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace